_posts/2014-09-28-Editing-org-mode-python-source-blocks-in-an-external-editor-(Canopy).html
---
title: Editing org-mode python source blocks in an external editor (Canopy)
date: 2014/09/28 14:41:49
updated: 2014/09/28 14:41:49
categories: orgmode,python
tags: 
---


<p>
Continuing on the <a href="http://kitchingroup.cheme.cmu.edu/blog/2014/09/27/Improved-debugging-of-Python-code-blocks-in-org-mode/">last post</a> about leveraging org-mode and python syntax checkers, here we consider using (heresy alert&#x2026;) an external editor for Python src blocks in org-mode. Why would we consider such insanity? Because, for beginners, environments such as Canopy are (IMHO) easier to use, and better than anything I have used in Emacs. And, I still want the framework of org-mode for content, just a better Python code writing environment.
</p>

<p>
This problem has some interesting challenges. I would like a command that opens a code block with its contents in the Canopy editor, or that creates a code block if needed. We need to figure out that context based on the cursor position. We will use the same temporary file strategy as used before, so Canopy has something to read and save to. We need to wait for Canopy to finish, which will be tricky because it returns as soon as you run it. Finally, I want the code block to run after it is put back in the org-file, so that the results are captured. 
</p>

<p>
This code block implements the idea, and the comments in the code explain what each section is doing.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">edit-in-canopy</span> ()
  (interactive)
  (<span style="color: #8b0000;">let*</span> ((eop (org-element-at-point))
         ;; <span style="color: #ff0000; font-weight: bold;">use current directory for temp file so relative paths work</span>
         (temporary-file-directory <span style="color: #228b22;">"."</span>)
         (tempfile))

    ;; <span style="color: #ff0000; font-weight: bold;">create a tempfile. </span>
    (setq tempfile (make-temp-file <span style="color: #228b22;">"canopy"</span> nil <span style="color: #228b22;">".py"</span>))

    ;; <span style="color: #ff0000; font-weight: bold;">figure out what to do</span>
    (<span style="color: #8b0000;">when</span>
        ;; <span style="color: #ff0000; font-weight: bold;">in an existing source block. we want to edit it.</span>
        (and (eq 'src-block (car eop))
             (string= <span style="color: #228b22;">"python"</span> (org-element-property <span style="color: #cd0000;">:language</span> eop)))
          
      ;; <span style="color: #ff0000; font-weight: bold;">put code into tempfile</span>
      (<span style="color: #8b0000;">with-temp-file</span> tempfile
        (insert (org-element-property <span style="color: #cd0000;">:value</span> eop))))

    ;; <span style="color: #ff0000; font-weight: bold;">open tempfile in canopy</span>
    (shell-command (concat <span style="color: #228b22;">"canopy "</span> tempfile))
    (sleep-for 2) ;; <span style="color: #ff0000; font-weight: bold;">startup time. canopy is slow to showup in</span>
                  ;; <span style="color: #ff0000; font-weight: bold;">ps. This gives it some time to do that. Canopy</span>
                  ;; <span style="color: #ff0000; font-weight: bold;">returns right away, so we sleep while there is</span>
                  ;; <span style="color: #ff0000; font-weight: bold;">evidence that it is open. We get that evidence</span>
                  ;; <span style="color: #ff0000; font-weight: bold;">from ps by searching for canopy.app.main, which</span>
                  ;; <span style="color: #ff0000; font-weight: bold;">seems to exist in the output while Canopy is</span>
                  ;; <span style="color: #ff0000; font-weight: bold;">open.</span>
    (<span style="color: #8b0000;">while</span>
        (string-match <span style="color: #228b22;">"canopy\.app\.main"</span>
                      (shell-command-to-string <span style="color: #228b22;">"ps aux"</span>))
      ;; <span style="color: #ff0000; font-weight: bold;">pause a while, then check again.</span>
      (sleep-for 1))

    ;; <span style="color: #ff0000; font-weight: bold;">Canopy has closed, so we get the new script contents</span>
    (<span style="color: #8b0000;">let</span> ((new-contents (<span style="color: #8b0000;">with-temp-buffer</span>
                          (insert-file-contents tempfile)
                          (buffer-string))))
      (<span style="color: #8b0000;">cond</span>
       ;; <span style="color: #ff0000; font-weight: bold;">replace existing code block contents</span>
       ((and (eq 'src-block (car eop))
             (string= <span style="color: #228b22;">"python"</span> (org-element-property <span style="color: #cd0000;">:language</span> eop)))
        (goto-char (org-element-property <span style="color: #cd0000;">:begin</span> eop))
        (search-forward (org-element-property <span style="color: #cd0000;">:value</span> eop))
        (replace-match (concat new-contents <span style="color: #228b22;">"\n"</span>)))
       ;; <span style="color: #ff0000; font-weight: bold;">create new code block</span>
       (t
        (insert
         (format <span style="color: #228b22;">"\n#+BEGIN_SRC python</span>
<span style="color: #228b22;">%s</span>
<span style="color: #228b22;">#+END_SRC</span>
<span style="color: #228b22;">"</span> new-contents))
        ;; <span style="color: #ff0000; font-weight: bold;">go into new block so we can run it.</span>
        (previous-line 2))))

    ;; <span style="color: #ff0000; font-weight: bold;">delete the tempfile so they do not accumulate</span>
    (delete-file tempfile)
    ;; <span style="color: #ff0000; font-weight: bold;">and run the new block to get the results</span>
    (org-babel-execute-src-block)))
</pre>
</div>

<pre class="example">
edit-in-canopy
</pre>

<p>
That seems to work. It is difficult to tell from this post the function works as advertised. You can see it in action here: <a href="http://www.youtube.com/watch?v=-noKrT1dfFE">http://www.youtube.com/watch?v=-noKrT1dfFE</a> .
</p>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> scipy.integrate <span style="color: #8b0000;">import</span> odeint


<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">dydx</span>(y, x):
    <span style="color: #000000; background-color: #cccccc; font-weight: bold;">k</span> = <span style="color: #000000; background-color: #cccccc; font-weight: bold;">1</span>
    <span style="color: #8b0000;">return</span> -k * y

<span style="color: #8b0000;">print</span> odeint(dydx, <span style="color: #000000; background-color: #cccccc; font-weight: bold;">1</span>, [<span style="color: #000000; background-color: #cccccc; font-weight: bold;">0</span>, <span style="color: #000000; background-color: #cccccc; font-weight: bold;">1</span>])

<span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">print</span> np.exp(-<span style="color: #000000; background-color: #cccccc; font-weight: bold;">1</span>)
</pre>
</div>

<pre class="example">
[[ 1.        ]
 [ 0.36787947]]
0.367879441171
</pre>



<p>
We created this code block externally.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">print</span> <span style="color: #228b22;">'hello'</span>
</pre>
</div>

<pre class="example">
hello
</pre>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Summary thoughts</h2>
<div class="outline-text-2" id="text-1">
<p>
Opening Canopy is a little slow (and that is coming from someone who opens Emacs ;). But, once it is open it is pretty nice for writing code, with the interactive Ipython console, and integrated help. Yes, it is probably possible to get Emacs to do that too, and maybe it will do that one day. Canopy does it today.
</p>

<p>
Unfortunately, this code will not work on Windows, most likely, since it relies on the ps program. There does seem to be a tasklist function in Windows that is similar, but it seems that Canopy runs as pythonw in that function, which is not very specific.</p>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/09/28/Editing-org-mode-python-source-blocks-in-an-external-editor-(Canopy).org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>